Pandas Library

It help us to analyze the data.

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\pk801\.pyenv\pyenv-win\versions\3.11.3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip available: 22.3.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

mydataset = {
    'cars' : ["BMW", "VOLVO", "fORD"],
    'Avg' : [10, 9, 12]
}

In [7]:
data = pd.DataFrame(mydataset)

In [8]:
data

    cars  Avg
0    BMW   10
1  VOLVO    9
2   fORD   12

In [9]:
type(data)

pandas.core.frame.DataFrame

In [11]:
type(data["Avg"])

pandas.core.series.Series

In [13]:
# create a blank dataframe
data = pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

### Data (Input Data)

In [14]:
# can we create a series without creating a dataframe?
# Yes
series_ex = pd.Series([1,7,7])

In [16]:
type(series_ex)

pandas.core.series.Series

In [17]:
import numpy as np
data = np.array(["a","b","c","d"])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

### index

In [18]:
import numpy as np
data = np.array(["a","b","c","d"])
s = pd.Series(data, index = [100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [24]:
s[100]

'a'

### Create a series from a dict

In [26]:
data = {'a':1,"b":2,"c":3, "d":4}
s = pd.Series(data)
s

a    1
b    2
c    3
d    4
dtype: int64

In [43]:
data = {'a':1,"b":2,"c":3, "d":4}
s = pd.Series(data, index = ['b', 'c', 'd', 'a', 'r'])
s

b    2.0
c    3.0
d    4.0
a    1.0
r    NaN
dtype: float64

In [29]:
s.dtypes

dtype('float64')

## Accessing the data from series with position

In [31]:
s = pd.Series([1,2,3,4,5], index =  ['b', 'c', 'd', 'e','a'])
s

b    1
c    2
d    3
e    4
a    5
dtype: int64

In [33]:
s[:3]

b    2
c    3
d    4
dtype: int64

In [34]:
s['b']

2

### DataFrame
- List
- Dictionary
- Numpy Array
- Another DataFrame
- Load the File (CSV, JSON, TSV, Excel, SQL)

## List

data = [["Alex", 23], ["Alex", 23], ["Bob", 23], ["Clerk", 23]]

df = pd.DataFrame(data, columns = ["Name", "Age"])
df["Age"] = df["Age"].astype(float)
df

In [53]:

data = [{"Name":"Alex","Age": 23}, {"Name":"Alex","Age": 23}, {"Name":"Alex","Age": 23},{"Name":"Alex","Age": 23}]

df = pd.DataFrame(data)
df["Age"] = df["Age"].astype(float)
df

   Name   Age
0  Alex  23.0
1  Alex  23.0
2  Alex  23.0
3  Alex  23.0

### Columns Updaton

In [57]:
df["Age_Updated"] = df["Age"] + 10

In [59]:
del df["Age"]

In [60]:
df

   Name  Age_Updated
0  Alex         33.0
1  Alex         33.0
2  Alex         33.0
3  Alex         33.0

### Selection by Label

In [71]:
d = {"one" : pd.Series([1,2,3], index=[1, 3, 5]),
     "two" : pd.Series([1,2,3, 4], index=[1, 3, 5, 7])}

df = pd.DataFrame(d)
df

   one  two
1  1.0    1
3  2.0    2
5  3.0    3
7  NaN    4

In [73]:
df.loc[5]

one    3.0
two    3.0
Name: 5, dtype: float64

In [72]:
df.iloc[1]

one    2.0
two    2.0
Name: 3, dtype: float64

## Reading from External Source

In [74]:
data = pd.read_csv("annual-enterprise-survey-2023-financial-year-provisional-size-bands.csv")

In [76]:
data.describe()

              year
count  20124.00000
mean    2017.00000
std        3.74175
min     2011.00000
25%     2014.00000
50%     2017.00000
75%     2020.00000
max     2023.00000

In [77]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20124 entries, 0 to 20123
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  20124 non-null  int64
 1   industry_code_ANZSIC  20124 non-null  object
 2   industry_name_ANZSIC  20124 non-null  object
 3   rme_size_grp          20124 non-null  object
 4   variable              20124 non-null  object
 5   value                 20124 non-null  object
 6   unit                  20124 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.1+ MB

In [87]:
data[data["value"] == 'C']

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
62,2011,A,"Agriculture, Forestry and Fishing",g_100-199,Fixed tangible assets,C,DOLLARS(millions)
71,2011,A,"Agriculture, Forestry and Fishing",h_200+,Fixed tangible assets,C,DOLLARS(millions)
102,2011,B,Mining,c_6-9,"Sales, government funding, grants and subsidies",C,DOLLARS(millions)
123,2011,B,Mining,e_20-49,Operating profit before tax,C,DOLLARS(millions)
124,2011,B,Mining,e_20-49,Total assets,C,DOLLARS(millions)
...,...,...,...,...,...,...,...
19618,2023,M,"Professional, Scientific and Technical Services",h_200+,Total assets,C,DOLLARS(millions)
19974,2023,R,Arts and Recreation Services,c_6-9,"Sales, government funding, grants and subsidies",C,DOLLARS(millions)
19977,2023,R,Arts and Recreation Services,c_6-9,Operating profit before tax,C,DOLLARS(millions)
20013,2023,R,Arts and Recreation Services,g_100-199,Operating profit before tax,C,DOLLARS(millions)
20019,2023,R,Arts and Recreation Services,h_200+,"Sales, government funding, grants and subsidies",C,DOLLARS(millions)

In [81]:
data.tail()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
20119,2023,all,All Industries,j_Grand_Total,Total income,930995,DOLLARS(millions)
20120,2023,all,All Industries,j_Grand_Total,Total expenditure,832964,DOLLARS(millions)
20121,2023,all,All Industries,j_Grand_Total,Operating profit before tax,103616,DOLLARS(millions)
20122,2023,all,All Industries,j_Grand_Total,Total assets,2831894,DOLLARS(millions)
20123,2023,all,All Industries,j_Grand_Total,Fixed tangible assets,681890,DOLLARS(millions)

In [82]:
data["variable"]

0                                          Activity unit
1                                 Rolling mean employees
2                                Salaries and wages paid
3        Sales, government funding, grants and subsidies
4                                           Total income
                              ...
20119                                       Total income
20120                                  Total expenditure
20121                        Operating profit before tax
20122                                       Total assets
20123                              Fixed tangible assets
Name: variable, Length: 20124, dtype: object

In [88]:
data["unit"].value_counts()

unit
DOLLARS(millions)    15652
COUNT                 4472
Name: count, dtype: int64

In [95]:
data.loc[data["value"] == 'C', "value"] = 0

In [97]:
data[data["value"] == 'C']

Empty DataFrame
Columns: [year, industry_code_ANZSIC, industry_name_ANZSIC, rme_size_grp, variable, value, unit]
Index: []

In [100]:
data["value"] = data["value"].astype(int)

In [101]:
# create a new column with this dataframe named percentage of value
data["percentage"] = (data["value"] / data["value"].sum())*100

In [107]:
data.sort_values(by = "percentage",  ascending=False)

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit,percentage
20122,2023,all,All Industries,j_Grand_Total,Total assets,2831894,DOLLARS(millions),1.062782
18574,2022,all,All Industries,j_Grand_Total,Total assets,2750156,DOLLARS(millions),1.032106
17026,2021,all,All Industries,j_Grand_Total,Total assets,2519921,DOLLARS(millions),0.945701
15477,2020,all,All Industries,j_Grand_Total,Total assets,2384577,DOLLARS(millions),0.894908
13930,2019,all,All Industries,j_Grand_Total,Total assets,2228678,DOLLARS(millions),0.836401
...,...,...,...,...,...,...,...,...
15621,2021,B,Mining,g_100-199,Operating profit before tax,-69,DOLLARS(millions),-0.000026
9375,2017,B,Mining,a_0,Operating profit before tax,-74,DOLLARS(millions),-0.000028
7764,2016,A,"Agriculture, Forestry and Fishing",c_6-9,Operating profit before tax,-101,DOLLARS(millions),-0.000038
861,2011,K,Financial and Insurance Services,f_50-99,Operating profit before tax,-113,DOLLARS(millions),-0.000042
7827,2016,B,Mining,a_0,Operating profit before tax,-130,DOLLARS(millions),-0.000049

In [108]:
data.loc[data['percentage'] > 0.83, "industry_name_ANZSIC"]

13930    All Industries
15477    All Industries
17026    All Industries
18574    All Industries
20122    All Industries
Name: industry_name_ANZSIC, dtype: object

In [112]:
data[(data['percentage'] > 0.83)  (data["variable"] == "Operating profit before tax")]["industry_name_ANZSIC"]

Series([], Name: industry_name_ANZSIC, dtype: object)

In [ ]:
~  Note
& And
| OR
== equal
!= Not equal